-- Adminer 4.8.1 MySQL 5.7.24 dump

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

SET NAMES utf8mb4;

DROP TABLE IF EXISTS `state`;
CREATE TABLE `state` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `arabic` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `french` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `latitude` decimal(10,8) NOT NULL DEFAULT '0.00000000',
  `longitude` decimal(10,8) NOT NULL DEFAULT '0.00000000',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `state` (`id`, `arabic`, `french`, `latitude`, `longitude`) VALUES
(1,	'أدرار',	'Adrar',	26.48881550,	-1.35824420),
(2,	' الشلف',	'Chlef',	36.20342000,	1.26806960),
(3,	'الأغواط',	'Laghouat',	33.75044050,	2.64310940),
(4,	'أم البواقي',	'Oum El Bouaghi',	35.81058050,	7.01841780),
(5,	'باتنة',	'Batna',	35.33842910,	5.73154530),
(6,	' بجاية',	'Béjaïa',	36.55690050,	4.78589250),
(7,	'بسكرة',	'Biskra',	34.78456350,	5.81243530),
(8,	'بشار',	'Béchar',	31.38572600,	-2.01159580),
(9,	'البليدة',	'Blida',	36.50125950,	2.95176660),
(10,	'البويرة',	'Bouira',	36.23164810,	3.90825790),
(11,	'تمنراست',	'Tamanrasset',	24.37534380,	4.32084360),
(12,	'تبسة',	'Tébessa',	35.12494500,	7.90117350),
(13,	'تلمسان',	'Tlemcen',	34.66746800,	-1.29781320),
(14,	'تيارت',	'Tiaret',	34.89475750,	1.59457920),
(15,	'تيزي وزو',	'Tizi Ouzou',	36.68161750,	4.23718600),
(16,	'الجزائر',	'Alger',	36.70005100,	3.02912660),
(17,	'الجلفة',	'Djelfa',	34.34284100,	3.21725310),
(18,	'جيجل',	'Jijel',	36.72921880,	5.96077760),
(19,	'سطيف',	'Sétif',	36.10566100,	5.56202760),
(20,	'سعيدة',	'Saïda',	34.74334900,	0.24407640),
(21,	'سكيكدة',	'Skikda',	36.75451150,	6.88562550),
(22,	'سيدي بلعباس',	'Sidi Bel Abbès',	34.68226800,	-0.43575550),
(23,	'عنابة',	'Annaba',	36.84388780,	7.59830680),
(24,	'قالمة',	'Guelma',	36.34916350,	7.40949900),
(25,	'قسنطينة',	'Constantine',	36.35841650,	6.66716740),
(26,	'المدية',	'Médéa',	35.97520450,	3.01235040),
(27,	'مستغانم',	'Mostaganem',	36.00269150,	0.36868670),
(28,	'المسيلة',	'M\'Sila',	35.13002050,	4.20031070),
(29,	'معسكر',	'Mascara',	35.39783850,	0.24301950),
(30,	'ورقلة',	'Ouargla',	31.92823306,	5.27516681),
(31,	'وهران',	'Oran',	35.62158620,	-0.70161430),
(32,	'البيض',	'El Bayadh',	32.57030300,	1.12595810),
(33,	'إليزي',	'Illizi',	27.85285050,	7.81896360),
(34,	'برج بوعريريج',	'Bordj Bou Arreridj',	36.09620290,	4.66027420),
(35,	'بومرداس',	'Boumerdès',	36.73580320,	3.61630460),
(36,	'الطارف',	'El Tarf',	36.67135630,	8.07013400),
(37,	'تندوف',	'Tindouf',	27.54390700,	-6.23992510),
(38,	'تيسمسيلت',	'Tissemsilt',	35.78589750,	1.83409570),
(39,	'الوادي',	'El Oued',	33.21544100,	7.15532140),
(40,	'خنشلة',	'Khenchela',	34.91334550,	6.90594310),
(41,	'سوق أهراس',	'Souk Ahras',	36.13786810,	7.82624260),
(42,	'تيبازة',	'Tipaza',	36.52715700,	2.16720120),
(43,	'ميلة',	'Mila',	36.25021350,	6.16521630),
(44,	'عين الدفلة',	'Aïn Defla',	36.15868430,	2.08428170),
(45,	'النعامة',	'Naâma',	33.23368510,	-0.81519580),
(46,	'عين تيموشنت',	'Aïn Témouchent',	35.36512970,	-0.94521710),
(47,	'غرداية',	'Ghardaïa',	32.44082700,	3.56182090),
(48,	'غليزان',	'Relizane',	35.83631850,	0.91185370),
(49,	'تيميمون',	'Timimoun',	29.26631963,	0.23483276),
(50,	'برج باجي مختار',	'Bordj Badji Mokhtar',	21.32437224,	0.94928741),
(51,	'بني عباس',	'Beni Abbes',	30.13174260,	-2.16903100),
(52,	'أولاد جلال',	'Ouled Djellal',	34.42541030,	5.06443420),
(53,	'عين صالح',	'In Salah',	27.19902208,	2.48016357),
(54,	'عين قزام',	'In Guezzam',	19.57044910,	5.76953888),
(55,	'تقرت',	'Touggourt',	33.10989680,	6.06610200),
(56,	'جانت',	'Djanet',	24.55149974,	9.48669434),
(57,	'المغير',	'El Mghair',	33.94968090,	5.92108900),
(58,	'المنيعة',	'El Menia',	30.58411440,	2.88219452);

-- 2004-12-31 23:08:22
